# 2.1　足し算・引き算

import numpy as np
A = np.matrix([[50, 40],[10, 10]])      # 行列A（朝）
B = np. matrix([[30, 100], [20, 15]])   # 行列B（夜）
A+B

# 2.2　行列の実数倍

A = np.matrix([[80, 140], [30, 25]])  # 行列A
0.8 * A   # 0.8×A

# 2.3　掛け算

A = np.matrix([[1, 3], [2, 1]])          # 行列A（掛けられる側）
B = np.matrix([[150, 250], [130, 230]])  # 行列B（掛ける側）
A * B

# 2.4　掛け算のルール

A = np.matrix([[1, 3], [2, 1]])  # 行列A（2×2行列）
B = np.matrix([[145], [72]])     # 行列B（2×1行列）
A * B

# 2.5　単位行列

A = np.matrix([[1, 3], [2, 1]])  # 行列A
E = np.matrix([[1, 0], [0, 1]])  # 単位行列E
A * E

E * A

# 2.6　逆行列

A = np.matrix([[5, 3], [2, 1]])  # 行列A
B = np.linalg.inv(A)             # 逆行列（B）を求める
B

(A * B).astype(np.int64)

# 2.7　逆行列と連立方程式

A = np.matrix([[5, 3], [2, 1]])  # 行列A（未知数の係数で作った行列）
inv_A = np.linalg.inv(A)   # 行列Aの逆行列
B = np.matrix([[9], [4]])  # 行列B（連立方程式の右辺）
inv_A * B  # 逆行列×行列B

a = 5  # 行列A（未知数の係数）
b = 3
c = 2
d = 1
s = 9  # 行列B（連立方程式の右辺）
t = 4
k = a*d - b*c  # 逆行列の各要素の分母
x = ((d/k)*s) + ((-b/k)*t)  # 逆行列×行列B
y = ((-c/k)*s) + ((a/k*t))
x, y